Revit 2027 API
BuiltInFailures.StairRampFailures.TreadDepthTooBigFailure Property
 The tread depth is too large for the spiral run.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TreadDepthTooBigFailure { get; }
Public Shared ReadOnly Property TreadDepthTooBigFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TreadDepthTooBigFailure {
	FailureDefinitionId^ get ();
}
static member TreadDepthTooBigFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace